In [1]:
import pandas as pd
import random
from src.deflator import deflate

Building an synthetic dataset. Important to notice that in yearly values the date column **must** be `int` type:

In [2]:
# building yearly synthetic dataset
yearly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2000", end="2018", freq="Y")
        .strftime("%Y")
        .astype("int"),  # selecting only the year and turning it into INT
        "value": [random.random() for i in range(18)],
    }
)
yearly_df.head()

   date     value
0  2000  0.097223
1  2001  0.194637
2  2002  0.533042
3  2003  0.989861
4  2004  0.851447

In [ ]:
# using the function with a yearly value deflating to  IPCA's 2001 values:

deflate(
    data_frame=yearly_df, 
    value_column="value", 
    date_column="date", 
    deflate_year=2001
).head()

   date     value  deflated_value
0  2000  0.097223        0.124868
1  2001  0.194637        0.194637
2  2002  0.533042        0.326431
3  2003  0.989861        0.816690
4  2004  0.851447        0.859732

When using monthly values, the date column **must** have the **"YYYY-MM"** format as `object`:

In [4]:
# monthly synthetic dataset:

monthly_df = pd.DataFrame(
    {
        "date": pd.date_range(start="2001", end="2006", freq="M").strftime("%Y-%m"),
        "value": [
            random.random()
            for i in range(len(pd.date_range(start="2001", end="2006", freq="M")))
        ],
    }
)
monthly_df.head()

      date     value
0  2001-01  0.285960
1  2001-02  0.632622
2  2001-03  0.278435
3  2001-04  0.838991
4  2001-05  0.583083

In [5]:
#deflating the series to IPCA's 2005-01 values:
deflate(
    data_frame=monthly_df,
    value_column="value",
    date_column="date",
    deflate_year=2005,
    deflate_month=1,
).head()

      date     value  deflated_value
0  2001-01  0.285960        0.308655
1  2001-02  0.632622        0.860367
2  2001-03  0.278435        0.525933
3  2001-04  0.838991        1.141027
4  2001-05  0.583083        0.809177